nxp-mcuxpresso/mcux-sdk-examples/mcxn9xxevk/usb_examples/usb_device_mtp_lite/bm/cm33_core0/mtp.c
    if (NULL == mtpHandle)
    {
        return kStatus_USB_InvalidHandle;
    }

    if (0U != mtpHandle->interruptInBusy)
    {
        return kStatus_USB_Busy;
    }

    mtpHandle->interruptInBusy = 1U;

    /* build event structure. */
    mtpHandle->eventContainer->containerLength = (event->paramNumber * 4U) + USB_DEVICE_MTP_MINIMUM_CONTAINER_LENGTH;
    mtpHandle->eventContainer->containerType   = USB_DEVICE_MTP_CONTAINER_TYPE_EVENT;
    mtpHandle->eventContainer->code            = event->code;
    mtpHandle->eventContainer->transactionID   = mtpHandle->mtpContainer->transactionID;
    mtpHandle->eventContainer->param1          = event->param1;
    mtpHandle->eventContainer->param2          = event->param2;
    mtpHandle->eventContainer->param3          = event->param3;

    error = USB_DeviceSendRequest(mtpHandle->handle, mtpHandle->interruptInEndpoint,
                                  (uint8_t *)mtpHandle->eventContainer, mtpHandle->eventContainer->containerLength);

    if (kStatus_USB_Success != error)
    {
        mtpHandle->interruptInBusy = 0U;
    }
    return error;
}

/*!
 * @brief Send response through bulk in endpoint.
 *
 * The function is used to send response through bulk in endpoint.
 * The function calls USB_DeviceSendRequest internally.
 *
 * @param handle The MTP class handle got from usb_device_class_config_struct_t::classHandle.
 * @param response Please refer to the structure usb_device_mtp_response_struct_t.
 *
 * @return A USB error code or kStatus_USB_Success.
 *
 * @note The function is used to asynchronously send response to the host. Some operations may consume a lot of time to
 * handle current transaction, such as CopyObject or DeleteObject, which causes the subsequent USB event cannot be
 * responded in time. In this case, a separated task is needed to handle these operations. When the process is complete,
 * a response needs to be sent to the host by calling this function.
 */
usb_status_t USB_DeviceMtpResponseSend(usb_device_mtp_struct_t *mtpHandle, usb_device_mtp_response_struct_t *response)
{
    if (NULL == mtpHandle)
    {
        return kStatus_USB_InvalidHandle;
    }

    return USB_DeviceMtpPrimeResponse(mtpHandle, response->code, &response->param1, response->paramNumber);
}

void USB_DeviceMtpProcessCommand(usb_device_mtp_struct_t *mtpHandle, usb_device_mtp_cmd_data_struct_t *dataInfo)
{
    usb_status_t status = kStatus_USB_Success;

    do
    {
        /* In the command phase, check transaction and session ID */
        if (dataInfo->curPhase == USB_DEVICE_MTP_PHASE_COMMAND)
        {
            /* Check transction ID */
            if (mtpHandle->mtpContainer->transactionID == (mtpHandle->transactionID + 1U))
            {
                mtpHandle->transactionID = mtpHandle->mtpContainer->transactionID;

                if (mtpHandle->transactionID == 0xFFFFFFFEU)
                {
                    mtpHandle->transactionID = 0;
                }
            }
            else
            {
                dataInfo->code = MTP_RESPONSE_INVALID_TRANSACTION_ID;
                break;
            }

            /* Check session ID */
            if (mtpHandle->mtpContainer->code != MTP_OPERATION_OPEN_SESSION &&
                mtpHandle->mtpContainer->code != MTP_OPERATION_GET_DEVICE_INFO)
            {
                if (mtpHandle->sessionID == 0U)
                {
                    dataInfo->code = MTP_RESPONSE_SESSION_NOT_OPEN;
                    break;
                }
            }

            /* Check Mutex */
            switch (mtpHandle->mtpContainer->code)
            {
                case MTP_OPERATION_OPEN_SESSION:
                case MTP_OPERATION_CLOSE_SESSION:
                case MTP_OPERATION_GET_DEVICE_INFO:
                case MTP_OPERATION_GET_DEVICE_PROP_DESC:
                case MTP_OPERATION_GET_OBJECT_PROPS_SUPPORTED:
                case MTP_OPERATION_GET_STORAGE_IDS:
                case MTP_OPERATION_GET_STORAGE_INFO:
                case MTP_OPERATION_GET_OBJECT_HANDLES:
                case MTP_OPERATION_GET_OBJECT_PROP_DESC:
                case MTP_OPERATION_GET_OBJECT_PROP_LIST:
                case MTP_OPERATION_GET_OBJECT_INFO:
                case MTP_OPERATION_GET_OBJECT:
                case MTP_OPERATION_SEND_OBJECT_INFO:
                case MTP_OPERATION_SEND_OBJECT:
                case MTP_OPERATION_GET_DEVICE_PROP_VALUE:
                case MTP_OPERATION_SET_DEVICE_PROP_VALUE:
                case MTP_OPERATION_GET_OBJECT_PROP_VALUE:
                case MTP_OPERATION_SET_OBJECT_PROP_VALUE:
                case MTP_OPERATION_GET_OBJECT_REFERENCES:
                case MTP_OPERATION_MOVE_OBJECT:
                    if (g_mtp.mutexUsbToDiskTask == 1U)
                    {
                        status = kStatus_USB_Error;
                    }
                    break;

                default:
                    /* no action */
                    break;
            }

            if (status != kStatus_USB_Success)
            {
                break; /* return */
            }
        }

        /* Transaction and Session ID is correct, continue to proccess command. */
        switch (mtpHandle->mtpContainer->code)
        {
            case MTP_OPERATION_OPEN_SESSION:
                if (dataInfo->curPhase == USB_DEVICE_MTP_PHASE_COMMAND)
                {
                    mtpHandle->mtpState = USB_DEVICE_MTP_STATE_RESPONSE;

                    if (0U == mtpHandle->mtpContainer->param[0])
                    {
                        dataInfo->code = MTP_RESPONSE_INVALID_PARAMETER;
                    }

                    if (mtpHandle->sessionID == mtpHandle->mtpContainer->param[0])
                    {
                        dataInfo->code = MTP_RESPONSE_SESSION_ALREADY_OPEN;
                    }

                    mtpHandle->sessionID = mtpHandle->mtpContainer->param[0];
                }

                USB_DeviceCmdOpenSession(dataInfo);
                break;

