nxp-mcuxpresso/mcux-sdk-examples/mcxn9xxevk/usb_examples/usb_device_mtp_lite/bm/cm33_core0/mtp.c
            case MTP_OPERATION_CLOSE_SESSION:
                if (dataInfo->curPhase == USB_DEVICE_MTP_PHASE_COMMAND)
                {
                    mtpHandle->mtpState = USB_DEVICE_MTP_STATE_RESPONSE;

                    if (0U == mtpHandle->sessionID)
                    {
                        dataInfo->code = MTP_RESPONSE_SESSION_NOT_OPEN;
                    }

                    mtpHandle->sessionID     = 0;
                    mtpHandle->transactionID = 0xFFFFFFFFU;
                }

                USB_DeviceCmdCloseSession(dataInfo);
                break;

            case MTP_OPERATION_GET_DEVICE_INFO:
            {
                usb_device_mtp_device_info_t deviceInfo;

                if (dataInfo->curPhase == USB_DEVICE_MTP_PHASE_COMMAND)
                {
                    deviceInfo.functionalMode         = MTP_FUNCTIONAL_MODE_STANDARD_MODE;
                    deviceInfo.mtpExtendsions         = NULL;
                    deviceInfo.opSupported            = &g_OpSupported[0];
                    deviceInfo.opSupportedLength      = sizeof(g_OpSupported);
                    deviceInfo.eventSupported         = &g_EventSupported[0];
                    deviceInfo.eventSupportedLength   = sizeof(g_EventSupported);
                    deviceInfo.devPropSupported       = &g_DevPropSupported[0];
                    deviceInfo.devPropSupportedLength = sizeof(g_DevPropSupported);
                    deviceInfo.captureFormat          = NULL;
                    deviceInfo.captureFormatLength    = 0;
                    deviceInfo.playbackFormat         = &g_ObjFormatSupported[0];
                    deviceInfo.playbackFormatLength   = sizeof(g_ObjFormatSupported);
                    deviceInfo.manufacturer           = "NXP";
                    deviceInfo.model                  = "NXP";
                    deviceInfo.deviceVersion          = "1.0";
                    deviceInfo.serialNumber           = "0123456789ABCDEF";
                }

                USB_DeviceCmdGetDeviceInfo(dataInfo, &deviceInfo);
                break;
            }

            case MTP_OPERATION_GET_DEVICE_PROP_DESC:
                USB_DeviceCmdGetDevicePropDesc(dataInfo);
                break;

            case MTP_OPERATION_GET_OBJECT_PROPS_SUPPORTED:
                USB_DeviceCmdGetObjPropsSupported(dataInfo);
                break;

            case MTP_OPERATION_GET_STORAGE_IDS:
                USB_DeviceCmdGetStorageIDs(dataInfo);
                break;

            case MTP_OPERATION_GET_STORAGE_INFO:
                USB_DeviceCmdGetStorageInfo(dataInfo);
                break;

            case MTP_OPERATION_GET_OBJECT_HANDLES:
                USB_DeviceCmdGetObjHandles(dataInfo);
                break;

            case MTP_OPERATION_GET_OBJECT_PROP_DESC:
                USB_DeviceCmdGetObjPropDesc(dataInfo);
                break;

            case MTP_OPERATION_GET_OBJECT_PROP_LIST:
                if (dataInfo->curPhase == USB_DEVICE_MTP_PHASE_COMMAND)
                {
                    /* Object Property Code and Object Property Group Code equals to 0. */
                    if ((mtpHandle->mtpContainer->param[2] == 0U) && (mtpHandle->mtpContainer->param[3] == 0U))
                    {
                        dataInfo->code = MTP_RESPONSE_PARAMETER_NOT_SUPPORTED;
                    }
                }
                USB_DeviceCmdGetObjPropList(dataInfo);
                break;

            case MTP_OPERATION_GET_OBJECT_INFO:
                USB_DeviceCmdGetObjInfo(dataInfo);
                break;

            case MTP_OPERATION_GET_OBJECT:
                USB_DeviceCmdGetObj(dataInfo);
                break;

            case MTP_OPERATION_SEND_OBJECT_INFO:
                USB_DeviceCmdSendObjInfo(dataInfo);
                break;

            case MTP_OPERATION_SEND_OBJECT:
                USB_DeviceCmdSendObj(dataInfo);
                break;

            case MTP_OPERATION_GET_DEVICE_PROP_VALUE:
                USB_DeviceCmdGetDevicePropVal(dataInfo);
                break;

            case MTP_OPERATION_SET_DEVICE_PROP_VALUE:
                USB_DeviceCmdSetDevicePropVal(dataInfo);
                break;

            case MTP_OPERATION_GET_OBJECT_PROP_VALUE:
                USB_DeviceCmdGetObjPropVal(dataInfo);
                break;

            case MTP_OPERATION_SET_OBJECT_PROP_VALUE:
                USB_DeviceCmdSetObjPropVal(dataInfo);
                break;

            case MTP_OPERATION_GET_OBJECT_REFERENCES:
                USB_DeviceCmdGetObjReferences(dataInfo);
                break;

            case MTP_OPERATION_MOVE_OBJECT:
                mtpHandle->mtpState = USB_DEVICE_MTP_STATE_RESPONSE;
                USB_DeviceCmdMoveObj(dataInfo);
                break;

            case MTP_OPERATION_DELETE_OBJECT:
                USB_DeviceMtpQueuePut((usb_device_mtp_cmd_data_struct_t *)dataInfo, kUSB_DeviceMtpEventDeleteObj);
                break;

            case MTP_OPERATION_COPY_OBJECT:
                USB_DeviceMtpQueuePut((usb_device_mtp_cmd_data_struct_t *)dataInfo, kUSB_DeviceMtpEventCopyObj);
                break;

            default:
                if (dataInfo->curPhase == USB_DEVICE_MTP_PHASE_COMMAND)
                {
                    /* Invalid command, need to stall Bulk-in & Bulk-out endpoints */
                    dataInfo->code = MTP_RESPONSE_OPERATION_NOT_SUPPORTED;
                }
                break;
        }

        /* Prime first data block */
        if ((dataInfo->curPhase == USB_DEVICE_MTP_PHASE_COMMAND) && (dataInfo->code == MTP_RESPONSE_UNDEFINED) &&
            (status == kStatus_USB_Success))
        {
            switch (mtpHandle->mtpContainer->code)
            {
                case MTP_OPERATION_GET_DEVICE_INFO:
                case MTP_OPERATION_GET_DEVICE_PROP_DESC:
                case MTP_OPERATION_GET_OBJECT_PROPS_SUPPORTED:
                case MTP_OPERATION_GET_STORAGE_IDS:
                case MTP_OPERATION_GET_STORAGE_INFO:
                case MTP_OPERATION_GET_OBJECT_HANDLES:
                case MTP_OPERATION_GET_OBJECT_PROP_DESC:
                case MTP_OPERATION_GET_OBJECT_PROP_LIST:
                case MTP_OPERATION_GET_OBJECT_INFO:
                case MTP_OPERATION_GET_OBJECT:
                case MTP_OPERATION_GET_DEVICE_PROP_VALUE:
                case MTP_OPERATION_GET_OBJECT_PROP_VALUE:
                case MTP_OPERATION_GET_OBJECT_REFERENCES:
                    USB_DevicePrimeDataIn(mtpHandle, dataInfo); /* C */
                    break;

                case MTP_OPERATION_SEND_OBJECT_INFO:
                case MTP_OPERATION_SEND_OBJECT:
                case MTP_OPERATION_SET_DEVICE_PROP_VALUE:
                case MTP_OPERATION_SET_OBJECT_PROP_VALUE:
                    USB_DevicePrimeDataOut(mtpHandle, dataInfo); /* C */
                    break;

                default:
                    /* no action */
                    break;
            }
        }
    } while (0);

    if (MTP_RESPONSE_UNDEFINED != dataInfo->code)
    {
        if (USB_DEVICE_MTP_STATE_RESPONSE == mtpHandle->mtpState) /* C */
        {
            /* Command-Response or Command-Data-Response transaction, prime response block here. */
#if (defined(USB_DEVICE_CONFIG_RETURN_VALUE_CHECK) && (USB_DEVICE_CONFIG_RETURN_VALUE_CHECK > 0U))
            if (kStatus_USB_Success != USB_DeviceMtpPrimeResponse(mtpHandle, dataInfo->code,
                                                                  (uint32_t *)&dataInfo->param[0], dataInfo->curSize))
            {
#if (defined(DEVICE_ECHO) && (DEVICE_ECHO > 0U))
                usb_echo("prime response error\r\n");
#endif
            }
#else
            (void)USB_DeviceMtpPrimeResponse(mtpHandle, dataInfo->code, (uint32_t *)&dataInfo->param[0],
                                             dataInfo->curSize);
#endif
        }
        else
        {
            /* Command-Data-Response transaction, error, stall Bulk-in & Bulk-out endpoints. */
            USB_DevicePrimeBulkInAndOutStall(mtpHandle, dataInfo->code, 0);
        }
    }
}

/*!
 * @brief Cancel current transacion.
 *
 * The function is used to cancel current transaction in the bulk in, bulk out and interrupt in endpoints.
 * The function calls USB_DeviceCancel internally. If there is a transaction ongoing, the function will call
 * callback function to inform application that the transaction is cancelled.
 *
 * @param handle The MTP class handle got from usb_device_class_config_struct_t::classHandle.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
usb_status_t USB_DeviceMtpCancelCurrentTransaction(usb_device_mtp_struct_t *mtpHandle)
{
    usb_device_mtp_cmd_data_struct_t dataInfo;

